updates to remove planned features, clean up docs, convert ascii charts to mermaid
